from enum import Enum


class MetaEventType:
    lifecycle = "lifecycle"  # 生命周期

    class Lifecycle:
        connect = "connect"  # 生命周期 - WebSocket 连接成功

    heartbeat = "heartbeat"  # 心跳


class MessageType:  # 接受消息大类
    private = "private"  # 私聊消息

    class Private:
        friend = "friend"  # 私聊消息 - 好友
        group = "group"  # 私聊消息 - 群临时
        group_self = "group_self"  # 私聊消息 - 群中自身发送
        other = "other"  # 私聊消息 - 其他

    group = "group"  # 群聊消息

    class Group:
        normal = "normal"  # 群聊消息 - 普通
        anonymous = "anonymous"  # 群聊消息 - 匿名消息
        notice = "notice"  # 群聊消息 - 系统提示


class NoticeType:  # 通知事件
    friend_recall = "friend_recall"  # 私聊消息撤回
    group_recall = "group_recall"  # 群聊消息撤回
    notify = "notify"
    group_ban = "group_ban"  # 群禁言
    group_msg_emoji_like = "group_msg_emoji_like"  # 群聊表情回复
    group_upload = "group_upload"  # 群文件上传
    group_increase = "group_increase"  # 群成员增加

    class Notify:
        poke = "poke"  # 戳一戳
        input_status = "input_status"  # 正在输入

    class GroupBan:
        ban = "ban"  # 禁言
        lift_ban = "lift_ban"  # 解除禁言


class RealMessageType:  # 实际消息分类
    text = "text"  # 纯文本
    face = "face"  # qq表情
    image = "image"  # 图片
    record = "record"  # 语音
    video = "video"  # 视频
    at = "at"  # @某人
    rps = "rps"  # 猜拳魔法表情
    dice = "dice"  # 骰子
    shake = "shake"  # 私聊窗口抖动（只收）
    poke = "poke"  # 群聊戳一戳
    share = "share"  # 链接分享（json形式）
    reply = "reply"  # 回复消息
    forward = "forward"  # 转发消息
    node = "node"  # 转发消息节点
    json = "json"  # json消息
    file = "file"  # 文件


class MessageSentType:
    private = "private"

    class Private:
        friend = "friend"
        group = "group"

    group = "group"

    class Group:
        normal = "normal"


class CommandType(Enum):
    """命令类型"""

    GROUP_BAN = "set_group_ban"  # 禁言用户
    GROUP_WHOLE_BAN = "set_group_whole_ban"  # 群全体禁言
    GROUP_KICK = "set_group_kick"  # 踢出群聊
    SEND_POKE = "send_poke"  # 戳一戳
    DELETE_MSG = "delete_msg"  # 撤回消息
    AI_VOICE_SEND = "ai_voice_send"  # AI语音发送
    SET_EMOJI_LIKE = "set_msg_emoji_like"  # 设置表情回应
    SEND_AT_MESSAGE = "send_at_message"  # 发送@消息
    SEND_LIKE = "send_like"  # 发送点赞

    def __str__(self) -> str:
        return self.value


# 支持的消息格式
ACCEPT_FORMAT = [
    "text",
    "image",
    "emoji",
    "reply",
    "voice",
    "command",
    "voiceurl",
    "music",
    "videourl",
    "file",
]

# 插件名称
PLUGIN_NAME = "napcat_adapter_plugin"

# QQ表情映射表
QQ_FACE = {
    "0": "[表情：惊讶]",
    "1": "[表情：撇嘴]",
    "2": "[表情：色]",
    "3": "[表情：发呆]",
    "4": "[表情：得意]",
    "5": "[表情：流泪]",
    "6": "[表情：害羞]",
    "7": "[表情：闭嘴]",
    "8": "[表情：睡]",
    "9": "[表情：大哭]",
    "10": "[表情：尴尬]",
    "11": "[表情：发怒]",
    "12": "[表情：调皮]",
    "13": "[表情：呲牙]",
    "14": "[表情：微笑]",
    "15": "[表情：难过]",
    "16": "[表情：酷]",
    "18": "[表情：抓狂]",
    "19": "[表情：吐]",
    "20": "[表情：偷笑]",
    "21": "[表情：可爱]",
    "22": "[表情：白眼]",
    "23": "[表情：傲慢]",
    "24": "[表情：饥饿]",
    "25": "[表情：困]",
    "26": "[表情：惊恐]",
    "27": "[表情：流汗]",
    "28": "[表情：憨笑]",
    "29": "[表情：悠闲]",
    "30": "[表情：奋斗]",
    "31": "[表情：咒骂]",
    "32": "[表情：疑问]",
    "33": "[表情：嘘]",
    "34": "[表情：晕]",
    "35": "[表情：折磨]",
    "36": "[表情：衰]",
    "37": "[表情：骷髅]",
    "38": "[表情：敲打]",
    "39": "[表情：再见]",
    "41": "[表情：发抖]",
    "42": "[表情：爱情]",
    "43": "[表情：跳跳]",
    "46": "[表情：猪头]",
    "49": "[表情：拥抱]",
    "53": "[表情：蛋糕]",
    "56": "[表情：刀]",
    "59": "[表情：便便]",
    "60": "[表情：咖啡]",
    "63": "[表情：玫瑰]",
    "64": "[表情：凋谢]",
    "66": "[表情：爱心]",
    "67": "[表情：心碎]",
    "74": "[表情：太阳]",
    "75": "[表情：月亮]",
    "76": "[表情：赞]",
    "77": "[表情：踩]",
    "78": "[表情：握手]",
    "79": "[表情：胜利]",
    "85": "[表情：飞吻]",
    "86": "[表情：怄火]",
    "89": "[表情：西瓜]",
    "96": "[表情：冷汗]",
    "97": "[表情：擦汗]",
    "98": "[表情：抠鼻]",
    "99": "[表情：鼓掌]",
    "100": "[表情：糗大了]",
    "101": "[表情：坏笑]",
    "102": "[表情：左哼哼]",
    "103": "[表情：右哼哼]",
    "104": "[表情：哈欠]",
    "105": "[表情：鄙视]",
    "106": "[表情：委屈]",
    "107": "[表情：快哭了]",
    "108": "[表情：阴险]",
    "109": "[表情：左亲亲]",
    "110": "[表情：吓]",
    "111": "[表情：可怜]",
    "112": "[表情：菜刀]",
    "114": "[表情：篮球]",
    "116": "[表情：示爱]",
    "118": "[表情：抱拳]",
    "119": "[表情：勾引]",
    "120": "[表情：拳头]",
    "121": "[表情：差劲]",
    "123": "[表情：NO]",
    "124": "[表情：OK]",
    "125": "[表情：转圈]",
    "129": "[表情：挥手]",
    "137": "[表情：鞭炮]",
    "144": "[表情：喝彩]",
    "146": "[表情：爆筋]",
    "147": "[表情：棒棒糖]",
    "169": "[表情：手枪]",
    "171": "[表情：茶]",
    "172": "[表情：眨眼睛]",
    "173": "[表情：泪奔]",
    "174": "[表情：无奈]",
    "175": "[表情：卖萌]",
    "176": "[表情：小纠结]",
    "177": "[表情：喷血]",
    "178": "[表情：斜眼笑]",
    "179": "[表情：doge]",
    "181": "[表情：戳一戳]",
    "182": "[表情：笑哭]",
    "183": "[表情：我最美]",
    "185": "[表情：羊驼]",
    "187": "[表情：幽灵]",
    "201": "[表情：点赞]",
    "212": "[表情：托腮]",
    "262": "[表情：脑阔疼]",
    "263": "[表情：沧桑]",
    "264": "[表情：捂脸]",
    "265": "[表情：辣眼睛]",
    "266": "[表情：哦哟]",
    "267": "[表情：头秃]",
    "268": "[表情：问号脸]",
    "269": "[表情：暗中观察]",
    "270": "[表情：emm]",
    "271": "[表情：吃瓜]",
    "272": "[表情：呵呵哒]",
    "273": "[表情：我酸了]",
    "277": "[表情：滑稽狗头]",
    "281": "[表情：翻白眼]",
    "282": "[表情：敬礼]",
    "283": "[表情：狂笑]",
    "284": "[表情：面无表情]",
    "285": "[表情：摸鱼]",
    "286": "[表情：魔鬼笑]",
    "287": "[表情：哦]",
    "289": "[表情：睁眼]",
    "293": "[表情：摸锦鲤]",
    "294": "[表情：期待]",
    "295": "[表情：拿到红包]",
    "297": "[表情：拜谢]",
    "298": "[表情：元宝]",
    "299": "[表情：牛啊]",
    "300": "[表情：胖三斤]",
    "302": "[表情：左拜年]",
    "303": "[表情：右拜年]",
    "305": "[表情：右亲亲]",
    "306": "[表情：牛气冲天]",
    "307": "[表情：喵喵]",
    "311": "[表情：打call]",
    "312": "[表情：变形]",
    "314": "[表情：仔细分析]",
    "317": "[表情：菜汪]",
    "318": "[表情：崇拜]",
    "319": "[表情：比心]",
    "320": "[表情：庆祝]",
    "323": "[表情：嫌弃]",
    "324": "[表情：吃糖]",
    "325": "[表情：惊吓]",
    "326": "[表情：生气]",
    "332": "[表情：举牌牌]",
    "333": "[表情：烟花]",
    "334": "[表情：虎虎生威]",
    "336": "[表情：豹富]",
    "337": "[表情：花朵脸]",
    "338": "[表情：我想开了]",
    "339": "[表情：舔屏]",
    "341": "[表情：打招呼]",
    "342": "[表情：酸Q]",
    "343": "[表情：我方了]",
    "344": "[表情：大怨种]",
    "345": "[表情：红包多多]",
    "346": "[表情：你真棒棒]",
    "347": "[表情：大展宏兔]",
    "349": "[表情：坚强]",
    "350": "[表情：贴贴]",
    "351": "[表情：敲敲]",
    "352": "[表情：咦]",
    "353": "[表情：拜托]",
    "354": "[表情：尊嘟假嘟]",
    "355": "[表情：耶]",
    "356": "[表情：666]",
    "357": "[表情：裂开]",
    "392": "[表情：龙年快乐]",
    "393": "[表情：新年中龙]",
    "394": "[表情：新年大龙]",
    "395": "[表情：略略略]",
    "396": "[表情：龙年快乐]",
    "424": "[表情：按钮]",
}


__all__ = [
    "ACCEPT_FORMAT",
    "PLUGIN_NAME",
    "QQ_FACE",
    "CommandType",
    "MessageSentType",
    "MessageType",
    "MetaEventType",
    "NoticeType",
    "RealMessageType",
]
